package org.example;
import java.util.Random;

/**
 *  TODO: Доработать приложение, которое разрабатывалось на семинаре,
 *  поработать с шаблоном проектирования Observer,
 *  добавить новый тип соискателя.
 *  Добавить новую сущность "Вакансия", компания должна рассылать вакансии.
 *  Только после этого вы можете усложнить ваше приложение (при желании), например,
 *  добавить тип вакансии (enum),
 *  учитывать тип вакансии при отправке предложения соискателю.
 */

public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}